# Name Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Dimension..::..Name Property
Dimension Class See Also
---
Retrieves or changes the name associated with the Dimension.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string Name { get; set; }
```

Visual Basic
---
```text
Public Property Name As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ Name {
	String^ get ();
	void set (String^ value);
}
```

# Remarks
The property inherited from element is hidden, a System.InvalidOperationException is thrown.
# See Also
Dimension Class
Autodesk.Revit.DB Namespace